RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim_hdsl.c
/*!
    \file    gd32h77x_78x_edim_hdsl.c
    \brief   EDIM HDSL driver

    \version 2026-06-18, V0.5.0, firmware for GD32H77x_78x
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x_78x_edim_hdsl.h"

#define EDIM_HDSL_MIR_ST_MASK              ((uint8_t)0x3FU)
#define EDIM_HDSL_EVENT_S_MASK             ((uint8_t)0x7FU)
#define EDIM_HDSL_ENC_ST_MASK              ((uint8_t)0x3FU)
/* EDIM_HDSL */
/*!
    \brief      deinit EDIM_HDSL (API_ID(0x0001U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_hdsl_deinit(void)
{
    rcu_periph_reset_enable(RCU_HDSLRST);
    rcu_periph_reset_disable(RCU_HDSLRST);
}

/*!
    \brief      initialize EDIM_HDSL (API_ID(0x0002U))
    \param[in]  es: external synchronization,
                0x00,position sampling during free running at the shortest cycle time
                others: position sampling with the SYNC input synchronized. es determines the number of position samplings carried out in one SYNC cycle.
    \param[in]  sync_polarity: sync edge selection
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SYNC_LEADING: the SYNC leading edge is used
      \arg        EDIM_HDSL_SYNC_TRAILING: the SYNC trailing edge is used
    \param[in]  acc_err_cnt: position error count threshold, 0~0x1F
    \param[out] none
    \retval     none
*/
void edim_hdsl_init(uint8_t es, uint8_t sync_polarity, uint8_t acc_err_cnt)
{
    EDIM_HDSL_SYNC_CTRL = es;
    EDIM_HDSL_SYS_CTRL &= (uint8_t)(~EDIM_HDSL_SYS_CTRL_SPOL);
    EDIM_HDSL_SYS_CTRL |= (uint8_t)sync_polarity;
    EDIM_HDSL_ACC_ERR_CNT = acc_err_cnt;

}

/*!
    \brief      activation of the output (API_ID(0x0003U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_hdsl_output_enable(void)
{
    EDIM_HDSL_SYS_CTRL |= (uint8_t)EDIM_HDSL_SYS_CTRL_OEN;
}

/*!
    \brief      unactivation of the output (API_ID(0x0004U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_hdsl_output_disable(void)
{
    EDIM_HDSL_SYS_CTRL &= (uint8_t)(~EDIM_HDSL_SYS_CTRL_OEN);

}

/*!
    \brief      test drive interface (API_ID(0x0005U))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void edim_hdsl_test_drive_interface(ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        EDIM_HDSL_SYS_CTRL |= (uint8_t)EDIM_HDSL_SYS_CTRL_LOOP;
    } else {
        EDIM_HDSL_SYS_CTRL &= (uint8_t)(~EDIM_HDSL_SYS_CTRL_LOOP);
    }
}

/*!
    \brief      reset pipeline FIFO (API_ID(0x0006U))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void edim_hdsl_pipeline_fifo_reset(ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        EDIM_HDSL_SYS_CTRL |= (uint8_t)EDIM_HDSL_SYS_CTRL_FRST;
    } else {
        EDIM_HDSL_SYS_CTRL &= (uint8_t)(~EDIM_HDSL_SYS_CTRL_FRST);
    }
}

/*!
    \brief      reset message (API_ID(0x0007U))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void edim_hdsl_message_reset(ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        EDIM_HDSL_SYS_CTRL |= (uint8_t)EDIM_HDSL_SYS_CTRL_MRST;
    } else {
        EDIM_HDSL_SYS_CTRL &= (uint8_t)(~EDIM_HDSL_SYS_CTRL_MRST);
    }
}

/*!
    \brief      reset protocol status (API_ID(0x0008U))
    \param[in]  newvalue: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void edim_hdsl_protocol_reset(ControlStatus newvalue)
{
    if(ENABLE == newvalue) {
        EDIM_HDSL_SYS_CTRL |= (uint8_t)EDIM_HDSL_SYS_CTRL_PRST;
    } else {
        EDIM_HDSL_SYS_CTRL &= (uint8_t)(~EDIM_HDSL_SYS_CTRL_PRST);
    }
}

/*!
    \brief      get quality monitoring bits (API_ID(0x0009U))
    \param[in]  none
    \param[out] none
    \retval     quality monitoring(QM): 0~0x0F
*/
uint8_t edim_hdsl_quality_monitoring_get(void)
{
    return (uint8_t)(EDIM_HDSL_MASTER_QM & EDIM_HDSL_MASTER_QM_QM);
}

/*!
    \brief      get DSL protocol connection status (API_ID(0x000AU))
    \param[in]  none
    \param[out] none
    \retval     DSL protocol connection: SET or RESET
*/
FlagStatus edim_hdsl_protocol_connection_status_get(void)
{
    FlagStatus reval = RESET;
    if(0U == (EDIM_HDSL_MASTER_QM & EDIM_HDSL_MASTER_QM_LINK)) {
        reval = RESET;
    } else {
        reval = SET;
    }
    return reval;
}

/*!
    \brief      get edges in cable signal (API_ID(0x000BU))
    \param[in]  none
    \param[out] none
    \retval     identification of edges in the cable signal: 0~0x0F
*/
uint8_t edim_hdsl_cable_signal_edge_get(void)
{
    return EDIM_HDSL_EDGES;
}

/*!
    \brief      get cable delay (API_ID(0x000CU))
    \param[in]  none
    \param[out] none
    \retval     4-bit value for cable delay: 0~0x09
*/
uint8_t edim_hdsl_cable_delay_get(void)
{
    return (uint8_t)(EDIM_HDSL_DELAY & EDIM_HDSL_DELAY_CBLDLY);
}

/*!
    \brief      get received signal strength (API_ID(0x000DU))
    \param[in]  none
    \param[out] none
    \retval     4-bit value for received signal strength: 0~0x0C
*/
uint8_t edim_hdsl_received_signal_strength_get(void)
{
    return (uint8_t)((EDIM_HDSL_DELAY & EDIM_HDSL_DELAY_RSSI) >> 4);
}


/*!
    \brief      version information (API_ID(0x000EU))
    \param[in]  none
    \param[out] none
    \retval     version number: 0~0xFF
*/
uint8_t edim_hdsl_version_get(void)
{
    return EDIM_HDSL_VERSION;
}

/*!
    \brief      get encoder ID information (API_ID(0x000FU))
    \param[in]  none
    \param[out] none
    \retval     encoder ID: 0~0xFFFFFFFF
*/
uint32_t edim_hdsl_encoder_id_get(void)
{
    uint32_t enc_id;
    /* get Encoder ID */
    enc_id = ((uint32_t)EDIM_HDSL_ENC_ID2 & 0x7FU);
    enc_id = ((uint32_t)EDIM_HDSL_ENC_ID1 | (enc_id << 8U));
    enc_id = ((uint32_t)EDIM_HDSL_ENC_ID0 | (enc_id << 8U));
    return enc_id;

