RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim_hdsl.c
    }
}

/*!
    \brief      select hdsl unit0 interface (API_ID(0x0042U))
    \param[in]  channel: hdsl channel
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_DRIVE: hdsl unit0 drive
      \arg        EDIM_HDSL_SAFE_CHANNEL1: hdsl unit0 safe channel 1
      \arg        EDIM_HDSL_SAFE_CHANNEL2: hdsl unit0 safe channel 2
    \param[in]  mode: interface mode
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_BUS_INTERFACE: internal bus interface
      \arg        EDIM_HDSL_SPI_INTERFACE: spi interface
    \param[out] none
    \retval     none
*/
void edim_hdsl_interface_select(uint8_t channel, uint8_t mode)
{
    if(EDIM_HDSL_DRIVE == channel) {
        if(EDIM_HDSL_BUS_INTERFACE == mode) {
            EDIM_HDSL_CTL &= (~EDIM_HDSL_CTL_DSEL);
        } else if(EDIM_HDSL_SPI_INTERFACE == mode) {
            EDIM_HDSL_CTL |= EDIM_HDSL_CTL_DSEL;
        } else {

        }
    } else if(EDIM_HDSL_SAFE_CHANNEL1 == channel) {
        if(EDIM_HDSL_BUS_INTERFACE == mode) {
            EDIM_HDSL_CTL &= (~EDIM_HDSL_CTL_SSEL1);
        } else if(EDIM_HDSL_SPI_INTERFACE == mode) {
            EDIM_HDSL_CTL |= EDIM_HDSL_CTL_SSEL1;
        } else {

        }
    } else if(EDIM_HDSL_SAFE_CHANNEL2 == channel) {
        if(EDIM_HDSL_BUS_INTERFACE == mode) {
            EDIM_HDSL_CTL |= EDIM_HDSL_CTL_SSEL2;
        } else if(EDIM_HDSL_SPI_INTERFACE == mode) {
            EDIM_HDSL_CTL &= (~EDIM_HDSL_CTL_SSEL2);
        } else {

        }
    } else {

    }
}

/*!
    \brief      configure hdsl position sampling resolution lock (API_ID(0x0043U))
    \param[in]  none
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_position_sampling_resolution_lock_get(void)
{
    FlagStatus reval = RESET;
    if(RESET != (EDIM_HDSL_SYNLK & EDIM_HDSL_SYNLK_SYNLK)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      configure hdsl POSTX interrupt source (API_ID(0x0044U))
    \param[in]  source: POSTX interrupt source
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_POSTX_SRC_01: when POSTX=2'b01
      \arg        EDIM_HDSL_POSTX_SRC_10: when POSTX=2'b10
      \arg        EDIM_HDSL_POSTX_SRC_11: when POSTX=2'b11
      \arg        EDIM_HDSL_POSTX_SRC_01_10_11: when POSTX = 2'b01, 2'b10, 2'b11
      \arg        EDIM_HDSL_POSTX_SRC_00_TO_01: when POSTX transfer from 2'b00 to 2'b01
      \arg        EDIM_HDSL_POSTX_SRC_00_TO_10: when POSTX transfer from 2'b00 to 2'b10
      \arg        EDIM_HDSL_POSTX_SRC_00_TO_01_10: when POSTX transfer from 2'b00 to 2'b01 or 2'b10
      \arg        EDIM_HDSL_POSTX_SRC_01_TO_10: when POSTX transfer from 2'b01 to 2'b10
      \arg        EDIM_HDSL_POSTX_SRC_10_TO_11: when POSTX transfer from 2'b10 to 2'b11
      \arg        EDIM_HDSL_POSTX_SRC_CHANGES: when POSTX changes
    \param[out] none
    \retval     none
*/
void edim_hdsl_postx_interrupt_source_select(uint32_t source)
{
    uint32_t reg_tmp;
    reg_tmp = EDIM_HDSL_INTEN;
    reg_tmp &= (~EDIM_HDSL_INTEN_INTSRC);
    reg_tmp |= (source & EDIM_HDSL_INTEN_INTSRC);
    EDIM_HDSL_INTEN = reg_tmp;
}

/*!
    \brief      enable POSTX interrupt (API_ID(0x0045U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_hdsl_postx_interrupt_enable(void)
{
    EDIM_HDSL_INTEN |= EDIM_HDSL_INTEN_POSTXIE;
}

/*!
    \brief      disable POSTX interrupt (API_ID(0x0046U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_hdsl_postx_interrupt_disable(void)
{
    EDIM_HDSL_INTEN &= (~EDIM_HDSL_INTEN_POSTXIE);
}

/*!
    \brief      enable safe channel 1 global interrupt (API_ID(0x0047U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_global_interrupt_enable(void)
{
    EDIM_HDSL_INTEN |= EDIM_HDSL_INTEN_INTSIE;
}

/*!
    \brief      disable safe channel 1 global interrupt (API_ID(0x0048U))
    \param[in]  none
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_global_interrupt_disable(void)
{
    EDIM_HDSL_INTEN &= (~EDIM_HDSL_INTEN_INTSIE);
}

/*!
    \brief      get EDIM_HDSL online d flag (API_ID(0x0049U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_ONLINE_D_FLAG_FREL: channel status for long message
      \arg        EDIM_HDSL_ONLINE_D_FLAG_QMLW: quality monitoring at low level
      \arg        EDIM_HDSL_ONLINE_D_FLAG_ANS: incorrect answer detected
      \arg        EDIM_HDSL_ONLINE_D_FLAG_MIN: acknowledgment of message Initialization
      \arg        EDIM_HDSL_ONLINE_D_FLAG_PRST: protocol reset
      \arg        EDIM_HDSL_ONLINE_D_FLAG_DTE: deviation threshold error
      \arg        EDIM_HDSL_ONLINE_D_FLAG_POS: estimator turned on
      \arg        EDIM_HDSL_ONLINE_D_FLAG_SUM: summary byte
      \arg        EDIM_HDSL_ONLINE_D_FLAG_INT: status of the interrupt signal
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_online_d_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;
    if(RESET != (EDIM_HDSL_ONLINE_STATUS_D & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      get online d position transmission status (API_ID(0x004AU))
    \param[in]  none
    \param[out] none
    \retval     position transmission status: 0~0x03
*/
uint8_t edim_hdsl_online_d_position_transmission_status_get(void)
{
    return (uint8_t)((EDIM_HDSL_ONLINE_STATUS_D & EDIM_HDSL_ONLINE_STATUS_D_POSTX) >> 6U);
}

/*!
    \brief      get EDIM_HDSL online 1 flag (API_ID(0x004BU))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_ONLINE_1_FLAG_FRES: channel Status for the short message
      \arg        EDIM_HDSL_ONLINE_1_FLAG_QMLW: quality monitoring at low level
      \arg        EDIM_HDSL_ONLINE_1_FLAG_MIN: acknowledgment of message Initialization
      \arg        EDIM_HDSL_ONLINE_1_FLAG_PRST: protocol reset
      \arg        EDIM_HDSL_ONLINE_1_FLAG_VPOS: safe Position Invalid
      \arg        EDIM_HDSL_ONLINE_1_FLAG_SCE: CRC Error on the Safe Channel
      \arg        EDIM_HDSL_ONLINE_1_FLAG_SSUM: safe summary bit
      \arg        EDIM_HDSL_ONLINE_1_FLAG_SINT: status of the interrupt signal
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_online_1_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;
    if(RESET != (EDIM_HDSL_ONLINE_STATUS_1 & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      get online 1 position transmission status (API_ID(0x004CU))
    \param[in]  none
    \param[out] none
    \retval     position transmission status: 0~0x03
*/
uint8_t edim_hdsl_online_1_position_transmission_status_get(void)
{
    return (uint8_t)((EDIM_HDSL_ONLINE_STATUS_1 & EDIM_HDSL_ONLINE_STATUS_1_POSTX) >> 6U);
}

/*!
    \brief      get EDIM_HDSL online 2 flag (API_ID(0x004DU))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_ONLINE_2_FLAG_QMLW: quality monitoring at low level
      \arg        EDIM_HDSL_ONLINE_2_FLAG_PRST: protocol reset
      \arg        EDIM_HDSL_ONLINE_2_FLAG_VPOS2: safe Position 2 Invalid
      \arg        EDIM_HDSL_ONLINE_2_FLAG_SCE2: transmission Error Channel 2
      \arg        EDIM_HDSL_ONLINE_2_FLAG_SSUM2: summary byte Channel 2
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_online_2_flag_get(uint32_t flag)
{
    FlagStatus reval = RESET;
    if(RESET != (EDIM_HDSL_ONLINE_STATUS_2 & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      get online 2 position transmission status (API_ID(0x004EU))
    \param[in]  none
    \param[out] none
    \retval     position transmission status: 0~0x03
*/
uint8_t edim_hdsl_online_2_position_transmission_status_get(void)
{
    return (uint8_t)((EDIM_HDSL_ONLINE_STATUS_2 & EDIM_HDSL_ONLINE_STATUS_2_POSTX) >> 6U);
}



/*!
    \brief      get EDIM_HDSL flag (API_ID(0x004FU))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_FLAG_PRST: protocol reset warning
      \arg        EDIM_HDSL_FLAG_DTE: estimator deviation threshold error
      \arg        EDIM_HDSL_FLAG_POS: estimator turned on
      \arg        EDIM_HDSL_FLAG_SUM: remote event monitoring
      \arg        EDIM_HDSL_FLAG_INT: interrupt status
      \arg        EDIM_HDSL_FLAG_FREL: channel free for "long message"
      \arg        EDIM_HDSL_FLAG_QMLW: quality monitoring low-value warning
      \arg        EDIM_HDSL_FLAG_ANS: error answer to "long message"
      \arg        EDIM_HDSL_FLAG_MIN: message initialization
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_flag_get(uint32_t flag)
{
    uint32_t status_reg;
    uint32_t reg1;
    uint32_t reg2;
    FlagStatus reval;
    reg1 = (uint32_t)EDIM_HDSL_EVENT_L;
    reg2 = ((uint32_t)EDIM_HDSL_EVENT_H) << 8U;
    status_reg = (reg1 | reg2);

    if(RESET != (status_reg & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;

