RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_edim_hdsl.c
}

/*!
    \brief      clear EDIM_HDSL safe channel 1 event flag (API_ID(0x0058U))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_FLAG_FRES: channel free for "short message"
      \arg        EDIM_HDSL_SAFE_FLAG_MIN: message initialization
      \arg        EDIM_HDSL_SAFE_FLAG_PRST: protocol reset warning
      \arg        EDIM_HDSL_SAFE_FLAG_QMLW: quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_FLAG_VPOS: safe position error
      \arg        EDIM_HDSL_SAFE_FLAG_SCE: error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_FLAG_SSUM: remote event monitoring
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_flag_clear(uint8_t flag)
{
    EDIM_HDSL_EVENT_S &= ((uint8_t)(~((uint32_t)flag & (uint32_t)EDIM_HDSL_EVENT_S_MASK)));
}

/*!
    \brief      enable EDIM_HDSL safe channel 1 interrupt (API_ID(0x0059U))
    \param[in]  interrupt: specify which interrupt to enable
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_INT_FRES: interrupt enable for channel free for "short message"
      \arg        EDIM_HDSL_SAFE_INT_MIN:  interrupt enable for message initialization
      \arg        EDIM_HDSL_SAFE_INT_PRST: interrupt enable for protocol reset warning
      \arg        EDIM_HDSL_SAFE_INT_QMLW: interrupt enable for quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_INT_VPOS: interrupt enable for safe position error
      \arg        EDIM_HDSL_SAFE_INT_SCE:  interrupt enable for error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_INT_SSUM: interrupt enable for remote event monitoring
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_interrupt_enable(uint8_t interrupt)
{
    EDIM_HDSL_MASK_S |= interrupt;
}

/*!
    \brief      disable EDIM_HDSL safe channel 1 interrupt (API_ID(0x005AU))
    \param[in]  interrupt: specify which interrupt to enable
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_INT_FRES: interrupt enable for channel free for "short message"
      \arg        EDIM_HDSL_SAFE_INT_MIN:  interrupt enable for message initialization
      \arg        EDIM_HDSL_SAFE_INT_PRST: interrupt enable for protocol reset warning
      \arg        EDIM_HDSL_SAFE_INT_QMLW: interrupt enable for quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_INT_VPOS: interrupt enable for safe position error
      \arg        EDIM_HDSL_SAFE_INT_SCE:  interrupt enable for error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_INT_SSUM: interrupt enable for remote event monitoring
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_interrupt_disable(uint8_t interrupt)
{
    EDIM_HDSL_MASK_S &= ((uint8_t)(~(uint32_t)interrupt));
}

/*!
    \brief      get EDIM_HDSL safe channel 1 interrupt event flag (API_ID(0x005BU))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_INT_FLAG_FRES: channel free for "short message"
      \arg        EDIM_HDSL_SAFE_INT_FLAG_MIN: message initialization
      \arg        EDIM_HDSL_SAFE_INT_FLAG_PRST: protocol reset warning
      \arg        EDIM_HDSL_SAFE_INT_FLAG_QMLW: quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_INT_FLAG_VPOS: safe position error
      \arg        EDIM_HDSL_SAFE_INT_FLAG_SCE: error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_INT_FLAG_SSUM: remote event monitoring
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_safe_channel1_interrupt_flag_get(uint8_t flag)
{
    FlagStatus reval;
    if(RESET != (EDIM_HDSL_EVENT_S & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}

/*!
    \brief      clear EDIM_HDSL safe channel 1 event flag (API_ID(0x005CU))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE_INT_FLAG_FRES: channel free for "short message"
      \arg        EDIM_HDSL_SAFE_INT_FLAG_MIN: message initialization
      \arg        EDIM_HDSL_SAFE_INT_FLAG_PRST: protocol reset warning
      \arg        EDIM_HDSL_SAFE_INT_FLAG_QMLW: quality monitoring low-value warning
      \arg        EDIM_HDSL_SAFE_INT_FLAG_VPOS: safe position error
      \arg        EDIM_HDSL_SAFE_INT_FLAG_SCE: error on the Safe Channel
      \arg        EDIM_HDSL_SAFE_INT_FLAG_SSUM: remote event monitoring
    \param[out] none
    \retval     none
*/
void edim_hdsl_safe_channel1_interrupt_flag_clear(uint8_t flag)
{
    EDIM_HDSL_EVENT_S &= ((uint8_t)(~((uint32_t)flag & (uint32_t)EDIM_HDSL_EVENT_S_MASK)));
}

/*!
    \brief      get EDIM_HDSL safe channel 2 flag (API_ID(0x005DU))
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        EDIM_HDSL_SAFE2_FLAG_ERR: safe Channel 2 position Error
      \arg        EDIM_HDSL_SAFE2_FLAG_TEST: safe Channel 2 test
      \arg        EDIM_HDSL_SAFE2_FLAG_TOG: safe Channel 2 toggle
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus edim_hdsl_safe_channel2_flag_get(uint8_t flag)
{
    FlagStatus reval = RESET;
    if(RESET != (EDIM_HDSL_STATUS2 & flag)) {
        reval = SET;
    } else {
        reval = RESET;
    }
    return reval;
}
